#### terraform plan every: 6195705
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-1:554506578892:certificate/cd63d2a1-3d6f-471d-958e-45a76da21eb0]
aws_api_gateway_rest_api.example: Refreshing state... [id=uo7vejn591]
aws_iam_role.iam_role_for_lambda: Refreshing state... [id=lambda-invoke-role]
aws_dynamodb_table.spotify-poc: Refreshing state... [id=spotify-poc]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/java_lambda_function]
aws_iam_policy.iam_policy_for_lambda: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda-invoke-policy]
aws_dynamodb_table.spotify-dynamo-music: Refreshing state... [id=spotify-dynamo-music]
aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=lambda-invoke-role-20210517054657159100000001]
aws_route53_record.validations["spotify-line.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net._CNAME]
aws_acm_certificate_validation.main: Refreshing state... [id=2021-06-30 02:30:13 +0000 UTC]
aws_api_gateway_domain_name.main: Refreshing state... [id=spotify-line.moikilo00.net]
aws_lambda_function.java_lambda_function: Refreshing state... [id=java_lambda_function]
aws_api_gateway_resource.proxy: Refreshing state... [id=ixthbt]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-uo7vejn591-6s0om962qh-ANY]
aws_route53_record.spotify-line: Refreshing state... [id=Z04052072YGY8CIREK2A2_spotify-line.moikilo00.net_A]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-uo7vejn591-ixthbt-ANY]
aws_iam_policy.lambda_dynamo: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo-policy]
aws_iam_policy.lambda_dynamo_music: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo_music-policy]
aws_iam_role_policy_attachment.lambda_dynamo_music: Refreshing state... [id=lambda-invoke-role-20210628073423139200000001]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=lambda-invoke-role-20210517180640035500000001]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-uo7vejn591-6s0om962qh-ANY]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-uo7vejn591-ixthbt-ANY]
aws_api_gateway_deployment.example: Refreshing state... [id=7avmde]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.java_lambda_function has been changed
  ~ resource "aws_lambda_function" "java_lambda_function" {
        id                             = "java_lambda_function"
      ~ last_modified                  = "2021-07-22T03:08:34.055+0000" -> "2021-07-22T03:11:46.285+0000"
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.java_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "java_lambda_function" {
        id                             = "java_lambda_function"
      ~ last_modified                  = "2021-07-22T03:11:46.285+0000" -> (known after apply)
      ~ source_code_hash               = "6MEWS97lLFK7SZc9MWN/HFqkFxrmcesz/MzNVKDG7io=" -> "coOD8c1kgjvnmzVsZut9f6KJ8j7jo93hi911/Y0KcP4="
        tags                           = {}
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.alb-lambda.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "spotify-line-bot.moikilo00.net"
      + domain_validation_options = [
          + {
              + domain_name           = "spotify-line-bot.moikilo00.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.alb-lambda.aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.alb-lambda.aws_alb.main will be created
  + resource "aws_alb" "main" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "spotify-line-bot-develop"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name" = "spotify-line-develop"
        }
      + tags_all                   = {
          + "Name" = "spotify-line-develop"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + access_logs {
          + bucket  = "spotify-line-bot-develop-lb-access-logs"
          + enabled = true
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.alb-lambda.aws_alb_listener.http will be created
  + resource "aws_alb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb-lambda.aws_alb_listener.https will be created
  + resource "aws_alb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb-lambda.aws_alb_target_group.main will be created
  + resource "aws_alb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "spotify-line-bot-develop"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "spotify-line-develop"
        }
      + tags_all                           = {
          + "Name" = "spotify-line-develop"
        }
      + target_type                        = "lambda"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.alb-lambda.aws_cloudwatch_dashboard.cloudwatch_dashboard will be created
  + resource "aws_cloudwatch_dashboard" "cloudwatch_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "spotify-line-bot-develop"
      + id             = (known after apply)
    }

  # module.alb-lambda.aws_iam_role.app_role will be created
  + resource "aws_iam_role" "app_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "spotify-line-bot-develop"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.alb-lambda.aws_iam_role_policy.cloudwatch will be created
  + resource "aws_iam_role_policy" "cloudwatch" {
      + id     = (known after apply)
      + name   = "cw-spotify-line-bot-develop"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeInstances",
                          + "ec2:AttachNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.alb-lambda.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "spotify-line-bot"
        }
      + tags_all = {
          + "Name" = "spotify-line-bot"
        }
      + vpc_id   = (known after apply)
    }

  # module.alb-lambda.aws_lambda_permission.allow_alb_to_invoke_lambda will be created
  + resource "aws_lambda_permission" "allow_alb_to_invoke_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "java_lambda_function"
      + id            = (known after apply)
      + principal     = "elasticloadbalancing.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromALB"
    }

  # module.alb-lambda.aws_lb_target_group_attachment.main will be created
  + resource "aws_lb_target_group_attachment" "main" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = "arn:aws:lambda:ap-northeast-1:554506578892:function:java_lambda_function"
    }

  # module.alb-lambda.aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.alb-lambda.aws_route53_record.main will be created
  + resource "aws_route53_record" "main" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "spotify-line-bot.moikilo00.net"
      + records         = (known after apply)
      + ttl             = 30
      + type            = "CNAME"
      + zone_id         = "Z04052072YGY8CIREK2A2"
    }

  # module.alb-lambda.aws_route53_record.validations["spotify-line-bot.moikilo00.net"] will be created
  + resource "aws_route53_record" "validations" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04052072YGY8CIREK2A2"
    }

  # module.alb-lambda.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "spotify-line-bot-public"
        }
      + tags_all         = {
          + "Name" = "spotify-line-bot-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.alb-lambda.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.alb-lambda.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.alb-lambda.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.alb-lambda.aws_s3_bucket.lb_access_logs will be created
  + resource "aws_s3_bucket" "lb_access_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "spotify-line-bot-develop-lb-access-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "spotify-line-develop"
        }
      + tags_all                    = {
          + "Name" = "spotify-line-develop"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 1
          + enabled                                = true
          + id                                     = "cleanup"

          + expiration {
              + days = 3
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.alb-lambda.aws_s3_bucket_policy.lb_access_logs will be created
  + resource "aws_s3_bucket_policy" "lb_access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.alb-lambda.aws_security_group.nsg_lambda will be created
  + resource "aws_security_group" "nsg_lambda" {
      + arn                    = (known after apply)
      + description            = "Limit connections from internal resources while allowing spotify-line-bot-develop-lambda to connect to all external resources"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "spotify-line-bot-develop-lambda"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "spotify-line-develop"
        }
      + tags_all               = {
          + "Name" = "spotify-line-develop"
        }
      + vpc_id                 = (known after apply)
    }

  # module.alb-lambda.aws_security_group.nsg_lb will be created
  + resource "aws_security_group" "nsg_lb" {
      + arn                    = (known after apply)
      + description            = "Allow connections from external resources while limiting connections from spotify-line-bot-develop-lb to internal resources"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "spotify-line-bot-develop-lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "spotify-line-develop"
        }
      + tags_all               = {
          + "Name" = "spotify-line-develop"
        }
      + vpc_id                 = (known after apply)
    }

  # module.alb-lambda.aws_security_group_rule.ingress_lb_http will be created
  + resource "aws_security_group_rule" "ingress_lb_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.alb-lambda.aws_security_group_rule.ingress_lb_https will be created
  + resource "aws_security_group_rule" "ingress_lb_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.alb-lambda.aws_security_group_rule.nsg_lambda_egress_rule will be created
  + resource "aws_security_group_rule" "nsg_lambda_egress_rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows lambda to establish connections to all resources"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.alb-lambda.aws_security_group_rule.nsg_lambda_ingress_rule will be created
  + resource "aws_security_group_rule" "nsg_lambda_ingress_rule" {
      + description              = "Only allow connections from SG spotify-line-bot-develop-lb on port 80"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.alb-lambda.aws_security_group_rule.nsg_lb_egress_rule will be created
  + resource "aws_security_group_rule" "nsg_lb_egress_rule" {
      + description              = "Only allow SG spotify-line-bot-develop-lb to connect to spotify-line-bot-develop-lambda on port 80"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.alb-lambda.aws_subnet.publics[0] will be created
  + resource "aws_subnet" "publics" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "spotify-line-bot-public-0"
        }
      + tags_all                        = {
          + "Name" = "spotify-line-bot-public-0"
        }
      + vpc_id                          = (known after apply)
    }

  # module.alb-lambda.aws_subnet.publics[1] will be created
  + resource "aws_subnet" "publics" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "spotify-line-bot-public-1"
        }
      + tags_all                        = {
          + "Name" = "spotify-line-bot-public-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.alb-lambda.aws_subnet.publics[2] will be created
  + resource "aws_subnet" "publics" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "spotify-line-bot-public-2"
        }
      + tags_all                        = {
          + "Name" = "spotify-line-bot-public-2"
        }
      + vpc_id                          = (known after apply)
    }

  # module.alb-lambda.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "spotify-line-bot"
        }
      + tags_all                         = {
          + "Name" = "spotify-line-bot"
        }
    }

Plan: 32 to add, 1 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on cert-route.tf line 27, in resource "aws_acm_certificate" "main":
  27:   provider          = "aws.virginia"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*